DELETE FROM noun_conjugation_table WHERE true;

INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, prefix_without_accents, suffix_without_accents, morphological_amount, morphological_case) VALUES
                                                                                                                                                                     ('λόγος', '', 'ος', '', 'ος', 0, 0),
                                                                                                                                                                     ('λόγος', '', 'ω', '', 'ω', 1, 0),
                                                                                                                                                                     ('λόγος', '', 'οι', '', 'οι', 2, 0),
                                                                                                                                                                     ('λόγος', '', 'ου', '', 'ου', 0, 1),
                                                                                                                                                                     ('λόγος', '', 'οιν', '', 'οιν', 1, 1),
                                                                                                                                                                     ('λόγος', '', 'ων', '', 'ων', 2, 1),
                                                                                                                                                                     ('λόγος', '', 'ῳ', '', 'ῳ', 0, 2),
                                                                                                                                                                     ('λόγος', '', 'οιν', '', 'οιν', 1, 2),
                                                                                                                                                                     ('λόγος', '', 'οις', '', 'οις', 2, 2),
                                                                                                                                                                     ('λόγος', '', 'ον', '', 'ον', 0, 3),
                                                                                                                                                                     ('λόγος', '', 'ω', '', 'ω', 1, 3),
                                                                                                                                                                     ('λόγος', '', 'ους', '', 'ους', 2, 3),
                                                                                                                                                                     ('λόγος', '', 'ε', '', 'ε', 0, 4),
                                                                                                                                                                     ('λόγος', '', 'ω', '', 'ω', 1, 4),
                                                                                                                                                                     ('λόγος', '', 'οι', '', 'οι', 2, 4);
-- Special plural forms of κῠ́κλος
INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, prefix_without_accents, suffix_without_accents, morphological_amount, morphological_case) VALUES
                                                                                                                                                                     ('κῠ́κλᾰ', '', 'ᾰ', '', 'α', 2, 0),
                                                                                                                                                                     ('κῠ́κλᾰ', '', 'ᾰ', '', 'α', 2, 3),
                                                                                                                                                                     ('κῠ́κλᾰ', '', 'ᾰ', '', 'α', 2, 4);


INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, prefix_without_accents, suffix_without_accents, morphological_amount, morphological_case) VALUES
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́', '', 'α', 0, 0),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́', '', 'α', 1, 0),
                                                                                                                                                                     ('θεᾱ́', '', 'αί', '', 'αι', 2, 0),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾶς', '', 'ας', 0, 1),
                                                                                                                                                                     ('θεᾱ́', '', 'αῖν', '', 'αιν', 1, 1),
                                                                                                                                                                     ('θεᾱ́', '', 'ῶν', '', 'ων', 2, 1),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾷ', '', 'ᾳ', 0, 2),
                                                                                                                                                                     ('θεᾱ́', '', 'αῖν', '', 'αιν', 1, 2),
                                                                                                                                                                     ('θεᾱ́', '', 'αῖς', '', 'αις', 2, 2),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́ν', '', 'αν', 0, 3),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́', '', 'α', 1, 3),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́ς', '', 'ας', 2, 3),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́', '', 'α', 0, 4),
                                                                                                                                                                     ('θεᾱ́', '', 'ᾱ́', '', 'α', 1, 4),
                                                                                                                                                                     ('θεᾱ́', '', 'αί', '', 'αι', 2, 4);

INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, prefix_without_accents, suffix_without_accents, morphological_amount, morphological_case) VALUES
                                                                                                                                                                     ('τῑμή', '', 'ή', '', 'η', 0, 0),
                                                                                                                                                                     ('τῑμή', '', 'ᾱ́', '', 'α', 1, 0),
                                                                                                                                                                     ('τῑμή', '', 'αί', '', 'αι', 2, 0),
                                                                                                                                                                     ('τῑμή', '', 'ῆς', '', 'ης', 0, 1),
                                                                                                                                                                     ('τῑμή', '', 'αῖν', '', 'αιν', 1, 1),
                                                                                                                                                                     ('τῑμή', '', 'ῶν', '', 'ων', 2, 1),
                                                                                                                                                                     ('τῑμή', '', 'ῇ', '', 'ῃ', 0, 2),
                                                                                                                                                                     ('τῑμή', '', 'αῖν', '', 'αιν', 1, 2),
                                                                                                                                                                     ('τῑμή', '', 'αῖς', '', 'αις', 2, 2),
                                                                                                                                                                     ('τῑμή', '', 'ήν', '', 'ην', 0, 3),
                                                                                                                                                                     ('τῑμή', '', 'ᾱ́', '', 'α', 1, 3),
                                                                                                                                                                     ('τῑμή', '', 'ᾱ́ς', '', 'ας', 2, 3),
                                                                                                                                                                     ('τῑμή', '', 'ή', '', 'η', 0, 4),
                                                                                                                                                                     ('τῑμή', '', 'ᾱ́', '', 'α', 1, 4),
                                                                                                                                                                     ('τῑμή', '', 'αί', '', 'αι', 2, 4);
