INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, morphological_amount, morphological_case, morphological_gender) VALUES
    ('λόγος', '', 'ος', 0, 0, 0),
    ('λόγος', '', 'ου', 0, 1, 0),
    ('λόγος', '', 'ῳ', 0, 2, 0),
    ('λόγος', '', 'ον', 0, 3, 0),
    ('λόγος', '', 'ε', 0, 4, 0),

    ('λόγος', '', 'ω', 1, 0, 0),
    ('λόγος', '', 'οιν', 1, 1, 0),
    ('λόγος', '', 'οιν', 1, 2, 0),
    ('λόγος', '', 'ω', 1, 3, 0),
    ('λόγος', '', 'ω', 1, 4, 0),

    ('λόγος', '', 'οι', 2, 0, 0),
    ('λόγος', '', 'ων', 2, 1, 0),
    ('λόγος', '', 'οις', 2, 2, 0),
    ('λόγος', '', 'ους', 2, 3, 0),
    ('λόγος', '', 'οι', 2, 4, 0);

-- θεά/θέα
-- The grammar of both is actually nearly the same, one conjugation is exactly the same.
-- Due to accents there are some differences. TODO: check if accents matter for grammar
INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, morphological_amount, morphological_case, morphological_gender) VALUES
    ('θεά', '', 'ᾱ́', 0, 0, 1), ('θέα', '', 'ᾱ', 0, 0, 1),
    ('θεά', '', 'ᾱ́', 1, 0, 1), ('θέα', '', 'ᾱ', 1, 0, 1),
    ('θεά', '', 'αί', 2, 0, 1), ('θέα', '', 'αι', 2, 0, 1),

    ('θεά', '', 'ᾶς', 0, 1, 1), ('θέα', '', 'ᾱς', 0, 1, 1),
    ('θεά', '', 'αῖν', 1, 1, 1), ('θέα', '', 'αιν', 1, 1, 1),
    ('θεά', '', 'ῶν', 2, 1, 1), ('θέα', '', 'ῶν', 2, 1, 1),     -- This one is the same

    ('θεά', '', 'ᾷ', 0, 2, 1), ('θέα', '', 'ᾳ', 0, 2, 1),
    ('θεά', '', 'αῖν', 1, 2, 1), ('θέα', '', 'αιν', 1, 2, 1),
    ('θεά', '', 'αῖς', 2, 2, 1), ('θέα', '', 'αις', 2, 2, 1),

    ('θεά', '', 'ᾱ́ν', 0, 3, 1), ('θέα', '', 'ᾱν', 0, 3, 1),
    ('θεά', '', 'ᾱ́', 1, 3, 1), ('θέα', '', 'ᾱ', 1, 3, 1),
    ('θεά', '', 'ᾱ́ς', 2, 3, 1), ('θέα', '', 'ᾱς', 2, 3, 1),

    ('θεά', '', 'ᾱ́', 0, 4, 1), ('θέα', '', 'ᾱ', 0, 4, 1),
    ('θεά', '', 'ᾱ́', 1, 4, 1), ('θέα', '', 'ᾱ', 1, 4, 1),
    ('θεά', '', 'αί', 2, 4, 1), ('θέα', '', 'αι', 2, 4, 1);
