DELETE FROM noun_conjugation_table WHERE true;

INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, morphological_amount, morphological_case, morphological_gender) VALUES
    -- λόγος
    ('λόγος', '', 'ος', 0, 0, 0),
    ('λόγος', '', 'ου', 0, 1, 0),
    ('λόγος', '', 'ῳ', 0, 2, 0),
    ('λόγος', '', 'ον', 0, 3, 0),
    ('λόγος', '', 'ε', 0, 4, 0),

    ('λόγος', '', 'ω', 1, 0, 0),
    ('λόγος', '', 'οιν', 1, 1, 0),
    ('λόγος', '', 'οιν', 1, 2, 0),
    ('λόγος', '', 'ω', 1, 3, 0),
    ('λόγος', '', 'ω', 1, 4, 0),

    ('λόγος', '', 'οι', 2, 0, 0),
    ('λόγος', '', 'ων', 2, 1, 0),
    ('λόγος', '', 'οις', 2, 2, 0),
    ('λόγος', '', 'ους', 2, 3, 0),
    ('λόγος', '', 'οι', 2, 4, 0);

INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, morphological_amount, morphological_case, morphological_gender) VALUES
    -- θεά/θέα
    -- Feminine with nominative singular on -ά/-α
    -- The grammar of both is actually nearly the same, one conjugation is exactly the same.
    -- Due to accents there are some differences. TODO: check if accents matter for grammar
    ('θεά', '', 'ᾱ́', 0, 0, 1), ('θέα', '', 'ᾱ', 0, 0, 1),
    ('θεά', '', 'ᾱ́', 1, 0, 1), ('θέα', '', 'ᾱ', 1, 0, 1),
    ('θεά', '', 'αί', 2, 0, 1), ('θέα', '', 'αι', 2, 0, 1),

    ('θεά', '', 'ᾶς', 0, 1, 1), ('θέα', '', 'ᾱς', 0, 1, 1),
    ('θεά', '', 'αῖν', 1, 1, 1), ('θέα', '', 'αιν', 1, 1, 1),
    ('θεά', '', 'ῶν', 2, 1, 1), ('θέα', '', 'ῶν', 2, 1, 1),     -- This one is the same

    ('θεά', '', 'ᾷ', 0, 2, 1), ('θέα', '', 'ᾳ', 0, 2, 1),
    ('θεά', '', 'αῖν', 1, 2, 1), ('θέα', '', 'αιν', 1, 2, 1),
    ('θεά', '', 'αῖς', 2, 2, 1), ('θέα', '', 'αις', 2, 2, 1),

    ('θεά', '', 'ᾱ́ν', 0, 3, 1), ('θέα', '', 'ᾱν', 0, 3, 1),
    ('θεά', '', 'ᾱ́', 1, 3, 1), ('θέα', '', 'ᾱ', 1, 3, 1),
    ('θεά', '', 'ᾱ́ς', 2, 3, 1), ('θέα', '', 'ᾱς', 2, 3, 1),

    ('θεά', '', 'ᾱ́', 0, 4, 1), ('θέα', '', 'ᾱ', 0, 4, 1),
    ('θεά', '', 'ᾱ́', 1, 4, 1), ('θέα', '', 'ᾱ', 1, 4, 1),
    ('θεά', '', 'αί', 2, 4, 1), ('θέα', '', 'αι', 2, 4, 1);

INSERT INTO noun_conjugation_table (conjugation_group, prefix, suffix, morphological_amount, morphological_case, morphological_gender) VALUES
    -- τῑμή
    -- Feminine with nominative singular on -ή
    ('τῑμή', '', 'ή', 0, 0, 1),
    ('τῑμή', '', 'ᾱ́', 1, 0, 1),
    ('τῑμή', '', 'αί', 2, 0, 1),
    ('τῑμή', '', 'ῆς', 0, 1, 1),
    ('τῑμή', '', 'ῇῐν', 1, 1, 1),
    ('τῑμή', '', 'ῶν', 2, 1, 1),
    ('τῑμή', '', 'ῇ', 0, 2, 1),
    ('τῑμή', '', 'ῇῐν', 1, 2, 1),
    ('τῑμή', '', 'αῖς', 2, 2, 1),
    ('τῑμή', '', 'ήν', 0, 3, 1),
    ('τῑμή', '', 'ᾱ́', 1, 3, 1),
    ('τῑμή', '', 'ᾱ́ς', 2, 3, 1),
    ('τῑμή', '', 'ή', 0, 4, 1),
    ('τῑμή', '', 'ᾱ́', 1, 4, 1),
    ('τῑμή', '', 'αί', 2, 4, 1);
